In [ ]:
# RUN THIS COMMAND ONLY IF YOU USE GOOGLE COLAB.
from google.colab import drive
drive.mount('/content/drive')

In [ ]:
# RUN THIS COMMAND ONLY IF YOU USE GOOGLE COLAB.
%cd drive/MyDrive/TechLabs/02_Data\ Manipulation/Part\ C\ -\ Pandas

# Chapter 9 - Cleaning Data - Casting Datatypes and Handling Missing Values
### Hey Techie,   
Welcome to the ninth notebook of this Pandas tutorial series. We encourage you to take this notebook as a template to code along the instruction video, which you may find at: https://youtu.be/KdmPHEnPJPs. In the instruction video's first half, Corey explains how to clean data within DataFrames. Afterward, he demonstrates the new skills with the real-world example which we already know. As always, at the end of this notebook are practice tasks to test your skills.     

**Here you may find the Pandas documentation:** https://pandas.pydata.org/docs/reference/index.html

#### Have fun! :-)   
    
*Video length*: 32 minutes   
*Self-study time*: 32 minutes   
*Total*: **64 minutes**
<hr style="border:2px solid gray"> </hr>   

## Code-Snippets

In [6]:
# This is the convention used to import Pandas.
import pandas as pd
# OTHER LIBRARIES.
import numpy as np

In [16]:
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', 
              None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [34]:
df = pd.DataFrame(people)


df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)

In [22]:
# START YOUR CODE HERE.
df.dropna()

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [26]:
df.dropna(axis='index', how='all')

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [36]:
df.dropna(axis='index', how='all', subset=['last', 'email'])

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
5   None      NaN      Anonymous@email.com  None

In [38]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [40]:
df.fillna('MISSING')

     first     last                    email      age
0    Corey  Schafer  CoreyMSchafer@gmail.com       33
1     Jane      Doe        JaneDoe@email.com       55
2     John      Doe        JohnDoe@email.com       63
3    Chris  Schafer                  MISSING       36
4  MISSING  MISSING                  MISSING  MISSING
5  MISSING  MISSING      Anonymous@email.com  MISSING
6  MISSING  MISSING                  MISSING  MISSING

In [44]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [46]:
df['age'] = df['age'].astype(float)

In [48]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [50]:
df['age'].mean()

46.75

In [ ]:
df.astype()

<hr style="border:2px solid gray"> </hr>   
    
## Real-word Example

In [8]:
# These options help us to inspect our data more easily.
pd.set_option("display.max_columns", 85)
pd.set_option("display.max_rows", 85)

In [54]:
# These commands load the same survey data Corey is using in his video.
file_path1 = "/Users/amrensch/Documents/Coding2025/02_Data Manipulation/data/survey_results_schema.csv"
file_path2 = "/Users/amrensch/Documents/Coding2025/02_Data Manipulation/data/survey_results_public.csv"
na_vals = ['NA', 'Missing']
df = pd.read_csv(file_path2, index_col = "Respondent", na_values=na_vals)
schema_df = pd.read_csv(file_path1, index_col = "Column")

In [56]:
# START YOUR CODE HERE.
df['YearsCode'].head(10)

Respondent
1       4
2     NaN
3       3
4       3
5      16
6      13
7       6
8       8
9      12
10     12
Name: YearsCode, dtype: object

In [58]:
df['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 'Less than 1 year', '30', '9', '26', '40', '19',
       '15', '20', '28', '25', '1', '22', '11', '33', '50', '41', '18',
       '34', '24', '23', '42', '27', '21', '36', '32', '39', '38', '31',
       '37', 'More than 50 years', '29', '44', '45', '48', '46', '43',
       '47', '49'], dtype=object)

In [60]:
df['YearsCode'].replace('Less than 1 year', 0, inplace=True)

/var/folders/cs/wy9fk11x7mscwysl2y4s8f0m0000gn/T/ipykernel_58616/4290426552.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['YearsCode'].replace('Less than 1 year', 0, inplace=True)

In [62]:
df['YearsCode'] = df['YearsCode'].replace({
    'Less than 1 year': 0,
    'More than 50 years': 51
})

In [64]:
df['YearsCode']= df['YearsCode'].astype(float)

In [66]:
df['YearsCode'].mean()

11.662114216834588

In [68]:
df['YearsCode'].median()

9.0

<hr style="border:2px solid gray"> </hr>   
   
## Practice Tasks

In [ ]:
# Load a clean DataFrame.
df = pd.read_csv("data/survey_results_public.csv", index_col = "Respondent")

#### 1. The survey DataFrame's index ranges from 1 to n, where n corresponds to the number of survey participants. Drop every row from the DataFrame where the questions Country, YearsCode, and ConvertedComp have not been answered. Do not make this drop in place but instead assign the cleaned DataFrame to a new variable named *cleaned_df*. Your final goal is to store the dropped indexes (i.e., 2679, 4271, etc.) in a list called *dropped_indexes*.
<br /> 
<details>    
<summary>
    <font size="3" color="red"><b>Hints (click to expand)</b></font>
</summary>
<p>
    <ul>
        <li>To solve this task, you need to set three parameters within the dropna-method: axis, how, and subset.</li>
        <li>One can access a DataFrame's index by calling the index attribute (i.e., df.index).</li>
        <li>A DataFrame's index can be treated the same as a list.</li>
        <li>To check whether a list contains a specific element, one can use the in operator (i.e., if element in list).</li>
    </ul>
</p>
</details>

In [ ]:
# START YOUR CODE HERE.

cleaned_df = ...
dropped_indexes = ...

# END YOUR CODE HERE.

In [ ]:
# THIS CELL TESTS YOUR RESULTS.
assert cleaned_df.shape == (88751, 84), "Your drop seems to be incorrect!"
assert len(dropped_indexes) == 132, "Your dropped_indexes list seems to have the wrong length!"
assert 12032 in dropped_indexes, "Your dropped_indexes list does not contain every index!"
assert 57311 in dropped_indexes, "Your dropped_indexes list does not contain every index!"
assert 73522 in dropped_indexes, "Your dropped_indexes list does not contain every index!"
assert 88802 in dropped_indexes, "Your dropped_indexes list does not contain every index!"

<details>    
<summary>
    <font size="3" color="darkgreen"><b>Solution (click to expand)</b></font>
</summary>
<p>
    <code>cleaned_df = df.dropna(axis = 0, how = "all", subset = ["Country", "YearsCode", "ConvertedComp"])</code><br />
    <code>dropped_indexes = [index for index in df.index if index not in cleaned_df.index]</code><br />
</p>
</details>   
   
#### 2. On average, when did participants write their first line of code (Age1stCode column)? To answer this question, replace "younger than" and "older than" statements within the YearsCode column with the nearest age. For example, "older than 45" would become 46. Store the mean in a variable named *mean_age_code*.
<br /> 
<details>    
<summary>
    <font size="3" color="red"><b>Hints (click to expand)</b></font>
</summary>
<p>
    <ul>
        <li>Remind yourself of the unique method which is applicable to Series objects.</li>
        <li>One needs to make replace-statements using Pandas in place or assign them to an existing/new Series object/DataFrame.</li>
        <li>You need to convert the Age1stCode column to float since NaN values are handled as float values.</li>
    </ul>
</p>
</details>

In [ ]:
# START YOUR CODE HERE.

mean_age_code = ...

# END YOUR CODE HERE.

In [ ]:
# THIS CELL TESTS YOUR RESULTS.
assert df["Age1stCode"].dtype == float, "You need to change the column's data type!"
assert round(mean_age_code, 2) == 15.41, "Your result seems to be incorrect!"
assert len(str(mean_age_code)) == 18, "Your result seems to be incorrect!"

<details>    
<summary>
    <font size="3" color="darkgreen"><b>Solution (click to expand)</b></font>
</summary>
<p>
    <code>df["Age1stCode"].replace("Younger than 5 years", 4, inplace = True)</code><br />
    <code>df["Age1stCode"].replace("Older than 85", 86, inplace = True)</code><br />
    <code>df["Age1stCode"] = df["Age1stCode"].astype(float)</code><br />
    <code>mean_age_code = df["Age1stCode"].mean()</code><br />
</p>
</details>